IDEA StatiCa Open Model
MatReinforcement.BarSurface Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 Surface of bar
 Namespace: IdeaRS.OpenModel.Material
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public ReinfBarSurface BarSurface { get; set; }
Public Property BarSurface As ReinfBarSurface
	Get
	Set
public:
property ReinfBarSurface BarSurface {
	ReinfBarSurface get ();
	void set (ReinfBarSurface value);
}
Property Value
Type: ReinfBarSurface
See Also
Reference
MatReinforcement Class
IdeaRS.OpenModel.Material Namespace